In [6]:
import pandas as pd
import numpy as np

In [11]:
df=pd.DataFrame(np.arange(0,6).reshape(3,2),index=['Row1','Row2','Row3'],columns=['Column1','Column2'])
df

      Column1  Column2
Row1        0        1
Row2        2        3
Row3        4        5

In [14]:
df.loc["Row1"]

Column1    0
Column2    1
Name: Row1, dtype: int64

In [15]:
type(df.loc["Row1"])

pandas.core.series.Series

In [21]:
df.iloc[:,:]

      Column1  Column2
Row1        0        1
Row2        2        3
Row3        4        5

In [20]:
type(df.iloc[:,:])

pandas.core.frame.DataFrame

In [25]:
df.iloc[0:2,1:]
# type(df.iloc[0:2,1:]) --> dataframe--> represented in row and column format

      Column2
Row1        1
Row2        3

In [26]:
df.values

array([[0, 1],
       [2, 3],
       [4, 5]])

In [31]:
df["Column1"].value_counts()

Column1
0    1
2    1
4    1
Name: count, dtype: int64

In [34]:
df["Column1"].unique()

array([0, 2, 4])

In [38]:
df=pd.read_csv('mercedesbenz.csv')
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [40]:
df.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

# csv file

In [41]:
from io import StringIO, BytesIO

In [42]:
data = ('col1,col2,col3\n'
            'x,y,1\n'
            'a,b,2\n'
            'c,d,3')

In [43]:
type(data)

str

In [46]:
df=pd.read_csv(StringIO(data)) # create text IO memory buffer
df

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [48]:
# To read specific columns
df=pd.read_csv(StringIO(data), usecols=['col1','col2'])
df

  col1 col2
0    x    y
1    a    b
2    c    d

In [49]:
df.to_csv('Test.csv')

In [52]:
# Specifying columns --> data types
data = ('a,b,c,d\n'
            '1,2,3,4\n'
            '5,6,7,8\n'
            '9,10,11,12')
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12

In [58]:
# df=pd.read_csv(StringIO(data),dtype=object)
# df
df=pd.read_csv(StringIO(data),dtype=int)
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [59]:
df['a']

0    1
1    5
2    9
Name: a, dtype: int64

In [62]:
pd.read_csv(StringIO(data),index_col=0) # make first column as index column

    b   c   d
a
1   2   3   4
5   6   7   8
9  10  11  12